```
krishna@turbotindias-MacBook-Pro azure_check_tagging % terraform apply --var-file=demo.tfvars
var.turbot_profile
  Enter profile matching your turbot cli credentials.

  Enter a value: punisher

turbot_smart_folder.azure_tagging: Refreshing state... [id=216458103267974]
turbot_policy_setting.default_tag_template["azure-aks-managed-cluster"]: Refreshing state... [id=216458107395786]
turbot_policy_setting.default_tag_template["azure-synapseanalytics-workspace"]: Refreshing state... [id=216458105556624]
turbot_policy_setting.default_tag_template["azure-storage-storage-account"]: Refreshing state... [id=216458106542775]
turbot_policy_setting.default_tag_template["azure-resourcegroup"]: Refreshing state... [id=216458107875030]
turbot_policy_setting.default_tag_template["azure-compute-virtual-machine"]: Refreshing state... [id=216458105856666]
turbot_policy_setting.default_tag_template["azure-sql-server"]: Refreshing state... [id=216458106310311]
turbot_policy_setting.default_tag_template["azure-network-application-security-group"]: Refreshing state... [id=216458108054235]
turbot_policy_setting.default_tag_template["azure-sql-database"]: Refreshing state... [id=216458109177589]
turbot_policy_setting.default_tag_template["azure-cosmosdb-database"]: Refreshing state... [id=216458107321028]
turbot_policy_setting.default_tag_template["azure-postgresql-server"]: Refreshing state... [id=216458108553958]
turbot_policy_setting.default_tag_template["azure-mysql-server"]: Refreshing state... [id=216458107186878]
turbot_policy_setting.set_resource_tag_policies["azure-cosmosdb-database"]: Refreshing state... [id=216458109157105]
turbot_policy_setting.set_resource_tag_policies["azure-network-application-security-group"]: Refreshing state... [id=216458109195001]
turbot_policy_setting.set_resource_tag_policies["azure-postgresql-server"]: Refreshing state... [id=216458105961120]
turbot_policy_setting.set_resource_tag_policies["azure-storage-storage-account"]: Refreshing state... [id=216458106452657]
turbot_policy_setting.set_resource_tag_policies["azure-resourcegroup"]: Refreshing state... [id=216458106436272]
turbot_policy_setting.set_resource_tag_policies["azure-synapseanalytics-workspace"]: Refreshing state... [id=216458107793105]
turbot_policy_setting.set_resource_tag_policies["azure-sql-database"]: Refreshing state... [id=216458108594922]
turbot_policy_setting.set_resource_tag_policies["azure-aks-managed-cluster"]: Refreshing state... [id=216458105777814]
turbot_policy_setting.set_resource_tag_policies["azure-sql-server"]: Refreshing state... [id=216458106412716]
turbot_policy_setting.set_resource_tag_policies["azure-mysql-server"]: Refreshing state... [id=216458108443360]
turbot_policy_setting.set_resource_tag_policies["azure-compute-virtual-machine"]: Refreshing state... [id=216458107389640]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # turbot_policy_setting.default_tag_template["azure-aks-managed-cluster"] will be created
  + resource "turbot_policy_setting" "default_tag_template" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + template                     = <<~EOT
            # Bring in environment metadata / attributes
            Name: "{{ $.resource.turbot.title }}"
            # Enforce selection of values, set to "Non-Compliant" if out of bounds
            Environment: "{% if $.resource.turbot.tags['Environment'] in ['Dev', 'QA', 'Prod', 'Temp'] %}{{ $.resource.turbot.tags['Environment'] }}{% else %}Non-Compliant Tag{% endif %}"
            # Actor who created the resource
            CreatedByActor: "{% if $.resource.creator.items[0].actor.identity.turbot.title == 'Unidentified Identity' %}{{ $.resource.creator.items[0].actor.alternatePersona }}{% else %}{{ $.resource.creator.items[0].actor.identity.turbot.title }}{% endif %}"
            # Creation Timestamp
            CreatedByTime: "{{ $.resource.creator.items[0].turbot.createTimestamp }}"
        EOT
      + template_input               = <<~EOT
            {
              resource {
                turbot {
                  title
                  tags
                }
                creator: notifications(filter: "sort:version_id limit:1") {
                  items {
                    actor {
                      alternatePersona
                      identity {
                        turbot {
                          title
                        }
                      }
                    }
                    turbot {
                      createTimestamp
                    }
                  }
                }
              }
            }
        EOT
      + type                         = "tmod:@turbot/azure-aks#/policy/types/managedClusterTagsTemplate"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.default_tag_template["azure-compute-virtual-machine"] will be created
  + resource "turbot_policy_setting" "default_tag_template" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + template                     = <<~EOT
            # Bring in environment metadata / attributes
            Name: "{{ $.resource.turbot.title }}"
            # Enforce selection of values, set to "Non-Compliant" if out of bounds
            Environment: "{% if $.resource.turbot.tags['Environment'] in ['Dev', 'QA', 'Prod', 'Temp'] %}{{ $.resource.turbot.tags['Environment'] }}{% else %}Non-Compliant Tag{% endif %}"
            # Actor who created the resource
            CreatedByActor: "{% if $.resource.creator.items[0].actor.identity.turbot.title == 'Unidentified Identity' %}{{ $.resource.creator.items[0].actor.alternatePersona }}{% else %}{{ $.resource.creator.items[0].actor.identity.turbot.title }}{% endif %}"
            # Creation Timestamp
            CreatedByTime: "{{ $.resource.creator.items[0].turbot.createTimestamp }}"
        EOT
      + template_input               = <<~EOT
            {
              resource {
                turbot {
                  title
                  tags
                }
                creator: notifications(filter: "sort:version_id limit:1") {
                  items {
                    actor {
                      alternatePersona
                      identity {
                        turbot {
                          title
                        }
                      }
                    }
                    turbot {
                      createTimestamp
                    }
                  }
                }
              }
            }
        EOT
      + type                         = "tmod:@turbot/azure-compute#/policy/types/virtualMachineTagsTemplate"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.default_tag_template["azure-cosmosdb-database"] will be created
  + resource "turbot_policy_setting" "default_tag_template" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + template                     = <<~EOT
            # Bring in environment metadata / attributes
            Name: "{{ $.resource.turbot.title }}"
            # Enforce selection of values, set to "Non-Compliant" if out of bounds
            Environment: "{% if $.resource.turbot.tags['Environment'] in ['Dev', 'QA', 'Prod', 'Temp'] %}{{ $.resource.turbot.tags['Environment'] }}{% else %}Non-Compliant Tag{% endif %}"
            # Actor who created the resource
            CreatedByActor: "{% if $.resource.creator.items[0].actor.identity.turbot.title == 'Unidentified Identity' %}{{ $.resource.creator.items[0].actor.alternatePersona }}{% else %}{{ $.resource.creator.items[0].actor.identity.turbot.title }}{% endif %}"
            # Creation Timestamp
            CreatedByTime: "{{ $.resource.creator.items[0].turbot.createTimestamp }}"
        EOT
      + template_input               = <<~EOT
            {
              resource {
                turbot {
                  title
                  tags
                }
                creator: notifications(filter: "sort:version_id limit:1") {
                  items {
                    actor {
                      alternatePersona
                      identity {
                        turbot {
                          title
                        }
                      }
                    }
                    turbot {
                      createTimestamp
                    }
                  }
                }
              }
            }
        EOT
      + type                         = "tmod:@turbot/azure-cosmosdb#/policy/types/databaseAccountTagsTemplate"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.default_tag_template["azure-mysql-server"] will be created
  + resource "turbot_policy_setting" "default_tag_template" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + template                     = <<~EOT
            # Bring in environment metadata / attributes
            Name: "{{ $.resource.turbot.title }}"
            # Enforce selection of values, set to "Non-Compliant" if out of bounds
            Environment: "{% if $.resource.turbot.tags['Environment'] in ['Dev', 'QA', 'Prod', 'Temp'] %}{{ $.resource.turbot.tags['Environment'] }}{% else %}Non-Compliant Tag{% endif %}"
            # Actor who created the resource
            CreatedByActor: "{% if $.resource.creator.items[0].actor.identity.turbot.title == 'Unidentified Identity' %}{{ $.resource.creator.items[0].actor.alternatePersona }}{% else %}{{ $.resource.creator.items[0].actor.identity.turbot.title }}{% endif %}"
            # Creation Timestamp
            CreatedByTime: "{{ $.resource.creator.items[0].turbot.createTimestamp }}"
        EOT
      + template_input               = <<~EOT
            {
              resource {
                turbot {
                  title
                  tags
                }
                creator: notifications(filter: "sort:version_id limit:1") {
                  items {
                    actor {
                      alternatePersona
                      identity {
                        turbot {
                          title
                        }
                      }
                    }
                    turbot {
                      createTimestamp
                    }
                  }
                }
              }
            }
        EOT
      + type                         = "tmod:@turbot/azure-mysql#/policy/types/serverTagsTemplate"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.default_tag_template["azure-network-application-security-group"] will be created
  + resource "turbot_policy_setting" "default_tag_template" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + template                     = <<~EOT
            # Bring in environment metadata / attributes
            Name: "{{ $.resource.turbot.title }}"
            # Enforce selection of values, set to "Non-Compliant" if out of bounds
            Environment: "{% if $.resource.turbot.tags['Environment'] in ['Dev', 'QA', 'Prod', 'Temp'] %}{{ $.resource.turbot.tags['Environment'] }}{% else %}Non-Compliant Tag{% endif %}"
            # Actor who created the resource
            CreatedByActor: "{% if $.resource.creator.items[0].actor.identity.turbot.title == 'Unidentified Identity' %}{{ $.resource.creator.items[0].actor.alternatePersona }}{% else %}{{ $.resource.creator.items[0].actor.identity.turbot.title }}{% endif %}"
            # Creation Timestamp
            CreatedByTime: "{{ $.resource.creator.items[0].turbot.createTimestamp }}"
        EOT
      + template_input               = <<~EOT
            {
              resource {
                turbot {
                  title
                  tags
                }
                creator: notifications(filter: "sort:version_id limit:1") {
                  items {
                    actor {
                      alternatePersona
                      identity {
                        turbot {
                          title
                        }
                      }
                    }
                    turbot {
                      createTimestamp
                    }
                  }
                }
              }
            }
        EOT
      + type                         = "tmod:@turbot/azure-network#/policy/types/applicationSecurityGroupTagsTemplate"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.default_tag_template["azure-postgresql-server"] will be created
  + resource "turbot_policy_setting" "default_tag_template" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + template                     = <<~EOT
            # Bring in environment metadata / attributes
            Name: "{{ $.resource.turbot.title }}"
            # Enforce selection of values, set to "Non-Compliant" if out of bounds
            Environment: "{% if $.resource.turbot.tags['Environment'] in ['Dev', 'QA', 'Prod', 'Temp'] %}{{ $.resource.turbot.tags['Environment'] }}{% else %}Non-Compliant Tag{% endif %}"
            # Actor who created the resource
            CreatedByActor: "{% if $.resource.creator.items[0].actor.identity.turbot.title == 'Unidentified Identity' %}{{ $.resource.creator.items[0].actor.alternatePersona }}{% else %}{{ $.resource.creator.items[0].actor.identity.turbot.title }}{% endif %}"
            # Creation Timestamp
            CreatedByTime: "{{ $.resource.creator.items[0].turbot.createTimestamp }}"
        EOT
      + template_input               = <<~EOT
            {
              resource {
                turbot {
                  title
                  tags
                }
                creator: notifications(filter: "sort:version_id limit:1") {
                  items {
                    actor {
                      alternatePersona
                      identity {
                        turbot {
                          title
                        }
                      }
                    }
                    turbot {
                      createTimestamp
                    }
                  }
                }
              }
            }
        EOT
      + type                         = "tmod:@turbot/azure-postgresql#/policy/types/serverTagsTemplate"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.default_tag_template["azure-resourcegroup"] will be created
  + resource "turbot_policy_setting" "default_tag_template" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + template                     = <<~EOT
            # Bring in environment metadata / attributes
            Name: "{{ $.resource.turbot.title }}"
            # Enforce selection of values, set to "Non-Compliant" if out of bounds
            Environment: "{% if $.resource.turbot.tags['Environment'] in ['Dev', 'QA', 'Prod', 'Temp'] %}{{ $.resource.turbot.tags['Environment'] }}{% else %}Non-Compliant Tag{% endif %}"
            # Actor who created the resource
            CreatedByActor: "{% if $.resource.creator.items[0].actor.identity.turbot.title == 'Unidentified Identity' %}{{ $.resource.creator.items[0].actor.alternatePersona }}{% else %}{{ $.resource.creator.items[0].actor.identity.turbot.title }}{% endif %}"
            # Creation Timestamp
            CreatedByTime: "{{ $.resource.creator.items[0].turbot.createTimestamp }}"
        EOT
      + template_input               = <<~EOT
            {
              resource {
                turbot {
                  title
                  tags
                }
                creator: notifications(filter: "sort:version_id limit:1") {
                  items {
                    actor {
                      alternatePersona
                      identity {
                        turbot {
                          title
                        }
                      }
                    }
                    turbot {
                      createTimestamp
                    }
                  }
                }
              }
            }
        EOT
      + type                         = "tmod:@turbot/azure#/policy/types/resourceGroupTagsTemplate"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.default_tag_template["azure-sql-database"] will be created
  + resource "turbot_policy_setting" "default_tag_template" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + template                     = <<~EOT
            # Bring in environment metadata / attributes
            Name: "{{ $.resource.turbot.title }}"
            # Enforce selection of values, set to "Non-Compliant" if out of bounds
            Environment: "{% if $.resource.turbot.tags['Environment'] in ['Dev', 'QA', 'Prod', 'Temp'] %}{{ $.resource.turbot.tags['Environment'] }}{% else %}Non-Compliant Tag{% endif %}"
            # Actor who created the resource
            CreatedByActor: "{% if $.resource.creator.items[0].actor.identity.turbot.title == 'Unidentified Identity' %}{{ $.resource.creator.items[0].actor.alternatePersona }}{% else %}{{ $.resource.creator.items[0].actor.identity.turbot.title }}{% endif %}"
            # Creation Timestamp
            CreatedByTime: "{{ $.resource.creator.items[0].turbot.createTimestamp }}"
        EOT
      + template_input               = <<~EOT
            {
              resource {
                turbot {
                  title
                  tags
                }
                creator: notifications(filter: "sort:version_id limit:1") {
                  items {
                    actor {
                      alternatePersona
                      identity {
                        turbot {
                          title
                        }
                      }
                    }
                    turbot {
                      createTimestamp
                    }
                  }
                }
              }
            }
        EOT
      + type                         = "tmod:@turbot/azure-sql#/policy/types/databaseTagsTemplate"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.default_tag_template["azure-sql-server"] will be created
  + resource "turbot_policy_setting" "default_tag_template" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + template                     = <<~EOT
            # Bring in environment metadata / attributes
            Name: "{{ $.resource.turbot.title }}"
            # Enforce selection of values, set to "Non-Compliant" if out of bounds
            Environment: "{% if $.resource.turbot.tags['Environment'] in ['Dev', 'QA', 'Prod', 'Temp'] %}{{ $.resource.turbot.tags['Environment'] }}{% else %}Non-Compliant Tag{% endif %}"
            # Actor who created the resource
            CreatedByActor: "{% if $.resource.creator.items[0].actor.identity.turbot.title == 'Unidentified Identity' %}{{ $.resource.creator.items[0].actor.alternatePersona }}{% else %}{{ $.resource.creator.items[0].actor.identity.turbot.title }}{% endif %}"
            # Creation Timestamp
            CreatedByTime: "{{ $.resource.creator.items[0].turbot.createTimestamp }}"
        EOT
      + template_input               = <<~EOT
            {
              resource {
                turbot {
                  title
                  tags
                }
                creator: notifications(filter: "sort:version_id limit:1") {
                  items {
                    actor {
                      alternatePersona
                      identity {
                        turbot {
                          title
                        }
                      }
                    }
                    turbot {
                      createTimestamp
                    }
                  }
                }
              }
            }
        EOT
      + type                         = "tmod:@turbot/azure-sql#/policy/types/serverTagsTemplate"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.default_tag_template["azure-storage-storage-account"] will be created
  + resource "turbot_policy_setting" "default_tag_template" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + template                     = <<~EOT
            # Bring in environment metadata / attributes
            Name: "{{ $.resource.turbot.title }}"
            # Enforce selection of values, set to "Non-Compliant" if out of bounds
            Environment: "{% if $.resource.turbot.tags['Environment'] in ['Dev', 'QA', 'Prod', 'Temp'] %}{{ $.resource.turbot.tags['Environment'] }}{% else %}Non-Compliant Tag{% endif %}"
            # Actor who created the resource
            CreatedByActor: "{% if $.resource.creator.items[0].actor.identity.turbot.title == 'Unidentified Identity' %}{{ $.resource.creator.items[0].actor.alternatePersona }}{% else %}{{ $.resource.creator.items[0].actor.identity.turbot.title }}{% endif %}"
            # Creation Timestamp
            CreatedByTime: "{{ $.resource.creator.items[0].turbot.createTimestamp }}"
        EOT
      + template_input               = <<~EOT
            {
              resource {
                turbot {
                  title
                  tags
                }
                creator: notifications(filter: "sort:version_id limit:1") {
                  items {
                    actor {
                      alternatePersona
                      identity {
                        turbot {
                          title
                        }
                      }
                    }
                    turbot {
                      createTimestamp
                    }
                  }
                }
              }
            }
        EOT
      + type                         = "tmod:@turbot/azure-storage#/policy/types/storageAccountTagsTemplate"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.default_tag_template["azure-synapseanalytics-workspace"] will be created
  + resource "turbot_policy_setting" "default_tag_template" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + template                     = <<~EOT
            # Bring in environment metadata / attributes
            Name: "{{ $.resource.turbot.title }}"
            # Enforce selection of values, set to "Non-Compliant" if out of bounds
            Environment: "{% if $.resource.turbot.tags['Environment'] in ['Dev', 'QA', 'Prod', 'Temp'] %}{{ $.resource.turbot.tags['Environment'] }}{% else %}Non-Compliant Tag{% endif %}"
            # Actor who created the resource
            CreatedByActor: "{% if $.resource.creator.items[0].actor.identity.turbot.title == 'Unidentified Identity' %}{{ $.resource.creator.items[0].actor.alternatePersona }}{% else %}{{ $.resource.creator.items[0].actor.identity.turbot.title }}{% endif %}"
            # Creation Timestamp
            CreatedByTime: "{{ $.resource.creator.items[0].turbot.createTimestamp }}"
        EOT
      + template_input               = <<~EOT
            {
              resource {
                turbot {
                  title
                  tags
                }
                creator: notifications(filter: "sort:version_id limit:1") {
                  items {
                    actor {
                      alternatePersona
                      identity {
                        turbot {
                          title
                        }
                      }
                    }
                    turbot {
                      createTimestamp
                    }
                  }
                }
              }
            }
        EOT
      + type                         = "tmod:@turbot/azure-synapseanalytics#/policy/types/synapseWorkspaceTagsTemplate"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_tag_policies["azure-aks-managed-cluster"] will be created
  + resource "turbot_policy_setting" "set_resource_tag_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-aks#/policy/types/managedClusterTags"
      + value                        = "Check: Tags are correct"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_tag_policies["azure-compute-virtual-machine"] will be created
  + resource "turbot_policy_setting" "set_resource_tag_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-compute#/policy/types/virtualMachineTags"
      + value                        = "Check: Tags are correct"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_tag_policies["azure-cosmosdb-database"] will be created
  + resource "turbot_policy_setting" "set_resource_tag_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-cosmosdb#/policy/types/databaseAccountTags"
      + value                        = "Check: Tags are correct"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_tag_policies["azure-mysql-server"] will be created
  + resource "turbot_policy_setting" "set_resource_tag_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-mysql#/policy/types/serverTags"
      + value                        = "Check: Tags are correct"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_tag_policies["azure-network-application-security-group"] will be created
  + resource "turbot_policy_setting" "set_resource_tag_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-network#/policy/types/applicationSecurityGroupTags"
      + value                        = "Check: Tags are correct"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_tag_policies["azure-postgresql-server"] will be created
  + resource "turbot_policy_setting" "set_resource_tag_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-postgresql#/policy/types/serverTags"
      + value                        = "Check: Tags are correct"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_tag_policies["azure-resourcegroup"] will be created
  + resource "turbot_policy_setting" "set_resource_tag_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure#/policy/types/resourceGroupTags"
      + value                        = "Check: Tags are correct"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_tag_policies["azure-sql-database"] will be created
  + resource "turbot_policy_setting" "set_resource_tag_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-sql#/policy/types/databaseTags"
      + value                        = "Check: Tags are correct"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_tag_policies["azure-sql-server"] will be created
  + resource "turbot_policy_setting" "set_resource_tag_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-sql#/policy/types/serverTags"
      + value                        = "Check: Tags are correct"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_tag_policies["azure-storage-storage-account"] will be created
  + resource "turbot_policy_setting" "set_resource_tag_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-storage#/policy/types/storageAccountTags"
      + value                        = "Check: Tags are correct"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.set_resource_tag_policies["azure-synapseanalytics-workspace"] will be created
  + resource "turbot_policy_setting" "set_resource_tag_policies" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/azure-synapseanalytics#/policy/types/synapseWorkspaceTags"
      + value                        = "Check: Tags are correct"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_smart_folder.azure_tagging will be created
  + resource "turbot_smart_folder" "azure_tagging" {
      + description = "Defines sets of policies for the Azure Tagging baseline"
      + id          = (known after apply)
      + parent      = "tmod:@turbot/turbot#/"
      + parent_akas = (known after apply)
      + title       = "Azure Tagging Policies"
    }

Plan: 23 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

turbot_smart_folder.azure_tagging: Creating...
turbot_smart_folder.azure_tagging: Creation complete after 1s [id=216458243496878]
turbot_policy_setting.set_resource_tag_policies["azure-cosmosdb-database"]: Creating...
turbot_policy_setting.set_resource_tag_policies["azure-storage-storage-account"]: Creating...
turbot_policy_setting.set_resource_tag_policies["azure-aks-managed-cluster"]: Creating...
turbot_policy_setting.default_tag_template["azure-compute-virtual-machine"]: Creating...
turbot_policy_setting.set_resource_tag_policies["azure-mysql-server"]: Creating...
turbot_policy_setting.default_tag_template["azure-storage-storage-account"]: Creating...
turbot_policy_setting.set_resource_tag_policies["azure-synapseanalytics-workspace"]: Creating...
turbot_policy_setting.default_tag_template["azure-network-application-security-group"]: Creating...
turbot_policy_setting.default_tag_template["azure-sql-server"]: Creating...
turbot_policy_setting.default_tag_template["azure-mysql-server"]: Creating...
turbot_policy_setting.set_resource_tag_policies["azure-synapseanalytics-workspace"]: Creation complete after 2s [id=216458245802942]
turbot_policy_setting.default_tag_template["azure-compute-virtual-machine"]: Creation complete after 2s [id=216458245768123]
turbot_policy_setting.set_resource_tag_policies["azure-resourcegroup"]: Creating...
turbot_policy_setting.default_tag_template["azure-cosmosdb-database"]: Creating...
turbot_policy_setting.default_tag_template["azure-sql-server"]: Creation complete after 3s [id=216458246104011]
turbot_policy_setting.default_tag_template["azure-network-application-security-group"]: Creation complete after 3s [id=216458245928899]
turbot_policy_setting.set_resource_tag_policies["azure-sql-database"]: Creating...
turbot_policy_setting.set_resource_tag_policies["azure-compute-virtual-machine"]: Creating...
turbot_policy_setting.default_tag_template["azure-mysql-server"]: Creation complete after 3s [id=216458246327251]
turbot_policy_setting.set_resource_tag_policies["azure-aks-managed-cluster"]: Creation complete after 3s [id=216458246400987]
turbot_policy_setting.set_resource_tag_policies["azure-cosmosdb-database"]: Creation complete after 3s [id=216458246491106]
turbot_policy_setting.set_resource_tag_policies["azure-sql-server"]: Creating...
turbot_policy_setting.set_resource_tag_policies["azure-network-application-security-group"]: Creating...
turbot_policy_setting.default_tag_template["azure-storage-storage-account"]: Creation complete after 3s [id=216458246339540]
turbot_policy_setting.set_resource_tag_policies["azure-storage-storage-account"]: Creation complete after 3s [id=216458246507494]
turbot_policy_setting.default_tag_template["azure-aks-managed-cluster"]: Creating...
turbot_policy_setting.set_resource_tag_policies["azure-mysql-server"]: Creation complete after 3s [id=216458246320082]
turbot_policy_setting.default_tag_template["azure-postgresql-server"]: Creating...
turbot_policy_setting.set_resource_tag_policies["azure-postgresql-server"]: Creating...
turbot_policy_setting.default_tag_template["azure-sql-database"]: Creating...
turbot_policy_setting.set_resource_tag_policies["azure-resourcegroup"]: Creation complete after 2s [id=216458247354354]
turbot_policy_setting.default_tag_template["azure-cosmosdb-database"]: Creation complete after 2s [id=216458247267309]
turbot_policy_setting.default_tag_template["azure-synapseanalytics-workspace"]: Creating...
turbot_policy_setting.default_tag_template["azure-resourcegroup"]: Creating...
turbot_policy_setting.set_resource_tag_policies["azure-sql-database"]: Creation complete after 2s [id=216458248076279]
turbot_policy_setting.default_tag_template["azure-postgresql-server"]: Creation complete after 2s [id=216458248654847]
turbot_policy_setting.set_resource_tag_policies["azure-compute-virtual-machine"]: Creation complete after 2s [id=216458248706053]
turbot_policy_setting.default_tag_template["azure-aks-managed-cluster"]: Creation complete after 2s [id=216458248645630]
turbot_policy_setting.default_tag_template["azure-sql-database"]: Creation complete after 2s [id=216458248721418]
turbot_policy_setting.set_resource_tag_policies["azure-sql-server"]: Creation complete after 2s [id=216458248798223]
turbot_policy_setting.default_tag_template["azure-resourcegroup"]: Creation complete after 1s [id=216458249237536]
turbot_policy_setting.set_resource_tag_policies["azure-postgresql-server"]: Creation complete after 2s [id=216458248885269]
turbot_policy_setting.default_tag_template["azure-synapseanalytics-workspace"]: Creation complete after 1s [id=216458249217052]
turbot_policy_setting.set_resource_tag_policies["azure-network-application-security-group"]: Creation complete after 3s [id=216458249376804]

Apply complete! Resources: 23 added, 0 changed, 0 destroyed.

Outputs:

resource_tags = {
  "azure-aks-managed-cluster" = "Check: Tags are correct"
  "azure-compute-virtual-machine" = "Check: Tags are correct"
  "azure-cosmosdb-database" = "Check: Tags are correct"
  "azure-mysql-server" = "Check: Tags are correct"
  "azure-network-application-security-group" = "Check: Tags are correct"
  "azure-postgresql-server" = "Check: Tags are correct"
  "azure-resourcegroup" = "Check: Tags are correct"
  "azure-sql-database" = "Check: Tags are correct"
  "azure-sql-server" = "Check: Tags are correct"
  "azure-storage-storage-account" = "Check: Tags are correct"
  "azure-synapseanalytics-workspace" = "Check: Tags are correct"
}
smart_folder_description = Defines sets of policies for the Azure Tagging baseline
smart_folder_name = Azure Tagging Policies
smart_folder_parent_resource = tmod:@turbot/turbot#/
turbot_profile = punisher